goal1:-
 writeln("введите диапозон: "),
 read(A),
 read(B),
 вывестинечетные(A,B).
 

нечетныйдиапозон(X,Y):-
 (Y>=X ->
  writeln(Y),
  Y1 is (Y-2),
  нечетныйдиапозон(X,Y1);
  writeln("Всё")
 ).

вывестинечетные(X,Y):-
 Y1 is (Y mod 2),
 (Y1=:=1 ->
  нечетныйдиапозон(X,Y);
  Y2 is (Y-1),
  нечетныйдиапозон(X,Y2)
 ).

 /*нечетное(1).

нечетныйдиапозон(X,Y):-
 X=<Y,
 writeln(X),
 X2 is X+2,
 нечетныйдиапозон(X2,Y),!.

нечетныйдиапозон(X,Y):-
 X>Y,!.

вывестинечетные(X,Y):-
 X1 is (X mod 2),
 нечетное(X1),
 нечетныйдиапозон(X,Y),!.

вывестинечетные(X,Y):-
 X1 is (X mod 2)+1,
 нечетное(X1),
 X2 is (X+1),
 нечетныйдиапозон(X2,Y),!.

*/
 /*Задача №2*/
 
goal2:-
 repeat,
 writeln("Введите номер числа Фибоначчи:"),
 read(A),
 (A>0 ->
  фибб(A,P),
  format('F(~w)=~w',[A,P]),nl,fail;
  writeln("Всё."),!
 ).

фибб(0,1):-!.
фибб(1,1):-!.

фибб(A,P):-
 A1 is (A-1),
 A2 is (A-2),
 фибб(A1,P1),
 фибб(A2,P2),
 P is (P1+P2).
 

 /*
 Я случайно сделал по индексам:)
goal3:-
 writeln("Введите массив:"),
 read(L),
 writeln("Введите 1-ый разделитель"),
 read(A1),
 writeln("Введите 2-ый разделитель"),
 read(A2),
 listsplit3(L,A1,A2,L1,L2,L3),
 writeln(L1),
 writeln(L2),
 writeln(L3).

listsplit3(L,A1,A2,L1,L2,L3):-
 A1<A2,!,
 N is A1,
 split(L,N,L1,Lt),
 N1 is (A2-A1),
 split(Lt,N1,L2,L3).

listsplit3(L,A1,A2,L1,L2,L3):-
 N is A2,
 split(L,N,L1,Lt),
 N1 is (A1-A2),
 split(Lt,N1,L2,L3).

split([],_,[],[]):-!.
split([Y|T],N,[Y|T1],T2):-N>0,!,N1 is (N-1),split(T,N1,T1,T2).
split([Y|T],N,T1,[Y|T2]):-N1 is (N-1), split(T,N1,T1,T2),!.

*/

goal3:-
 writeln("Введите массив:"),
 read(L),
 writeln("Введите 1-ый разделитель"),
 read(A1),
 writeln("Введите 2-ый разделитель"),
 read(A2),
 разделениетрёх(L,A1,A2,L1,L2,L3),
 writeln(L1),
 writeln(L2),
 writeln(L3).

разделениетрёх(L,A1,A2,L1,L2,L3):-
 A1<A2,!,
 N is A1,
 разделение(L,N,L1,Lt),
 N1 is (A2+1),
 разделение(Lt,N1,L2,L3).

разделениетрёх(L,A1,A2,L1,L2,L3):-
 N is A2,
 разделение(L,N,L1,Lt),
 N1 is (A1+1),
 разделение(Lt,N1,L2,L3).

разделение([],_,[],[]):-!.
разделение([Y|T],N,[Y|T1],T2):-Y<N,!,разделение(T,N,T1,T2).
разделение([Y|T],N,T1,[Y|T2]):-разделение(T,N,T1,T2).

/*Задача 4*/

удалить([],_,[]):-!.
удалить([X|T],X,T2):-удалить(T,X,T2),!.
удалить([Y|T],X,[Y|T1]):-удалить(T,X,T1).

длина([],0):-!.
длина([_|T],N):-длина(T,N1),N is N1+1.

goal4:-
 writeln("Введите массив"),
 read(L),
 встречаемость(L,Max,L1),
 write("Частота встречаемых букв: "),
 writeln(Max),
 write("Самые встречаемые буквы: "),
 writeln(L1).
 
встречаемость([],0,[]):-!.
 
встречаемость([H|T],Max,L0):-
 длина([H|T],N1),
 удалить([H|T],H,L2),
 длина(L2,N2),
 Max2 is(N1-N2),
 встречаемость(L2,Max3,L3),
 (Max3<Max2 ->
  L0=[H],
  Max is Max2;
  Max is Max3,
  (Max3>Max2 ->
   L0=L3;
   L0=[H|L3]
  )
 ).
 
 %[2,1,1,2,1]
 
